// lib/views/data/cardnews_list.dart

class CardnewsData {
  final String title;
  final String subtitle;
  final String content;

  CardnewsData(
    this.title,
    this.subtitle,
    this.content
  );
}

final List<CardnewsData> cardnewsList = [
  CardnewsData(
    "변비의 주요 증상",
    "서울아산병원 건강정보",
    "변비의 주요 증상에는 배변 시 과도한 힘이 들어감, 변이 과도하게 단단함, 배변 후에도 변이 남은 듯한 느낌, 복부 팽만감, 복통 등이 있습니다. 하복부의 불쾌감과 항문 출혈이 반복되면, 이차적으로 치질, 치열 등이 발생하면서 배변 시 항문 통증, 출혈이 나타날 수 있습니다. 만성 변비는 식욕 부진, 소화 불량을 유발합니다. 이는 다시 변비를 악화시키는 악순환으로 이어집니다. 만성 변비는 우울증의 원인이 되기도 합니다.",
  ),
  CardnewsData(
    "변비의 원인과 관리 방법",
    "나무위키",
    "변비는 다양한 원인으로 발생할 수 있습니다. 선천성 거대결장이나 갑상선 이상 등이 주요 원인으로 꼽히며, 이러한 원인들은 변비와 함께 무기력증이나 추위를 동반할 수 있습니다. 운동과 식습관 개선은 변비 관리에 효과적입니다. 아침 시간대에 30분 이상 빠르게 걷거나 뛰는 것이 장 운동을 촉진시키며, 충분한 수분 섭취와 식이섬유 보충이 중요합니다. 변의가 올 때 즉시 배출하도록 하고, 발받침을 활용한 올바른 배변 자세를 유지하세요. 필요 시 변비약은 의사와 상담 후 복용하십시오.",
  ),
  CardnewsData(
    "변비란 무엇인가?",
    "위키백과",
    "변비(便祕, constipation)는 대변이 대장에 오래 머무르면서 배출되지 않는 상태로, 변비증(便祕症)이라고도 합니다. 변비는 일반적으로 대변을 보지 않는 기간이 3일 이상 지속되거나, 대변을 보는데 어려움을 느끼거나, 잔변감(대변이 남아 있는 느낌)이 있는 경우 등에 따라 인식 및 진단됩니다. '매일 대변을 보지 않으면 안 된다.'라고 생각하는 사람도 있지만, 대변을 보는 간격은 체질과 환경에 따라 다양하며, 이를 일률적으로 결정하기는 어렵습니다.",
  ),
  CardnewsData(
    "성인 변비의 치료",
    "MSD 매뉴얼",
    "성인 변비를 치료하기 위해서는 변비를 일으키는 근본적인 원인을 해결하는 것이 중요합니다. 변비를 유발하는 약물을 복용 중이라면 가능하다면 중단하거나 변경해야 합니다. 변비는 운동, 고섬유질 식사, 적절한 수분 섭취로 예방하는 것이 가장 효과적입니다. 잠재적으로 변비를 유발할 수 있는 약물을 처방받거나 장기 요양을 하는 경우, 의사는 종종 설사제를 처방하는 대신 섬유질 식사와 수분 섭취를 늘릴 것을 권장합니다. 변비에 걸린 환자를 치료하는 방법으로는 식사 및 행동 개선, 설사제(완하제) 사용, 관장제 사용의 세 가지 접근법이 있습니다. 설사제, 좌약 및 관장제는 설사, 탈수, 경련, 또는 설사제 의존을 일으킬 수 있으므로 주의해서 사용해야 하며, 알 수 없는 원인, 염증성 장 질환, 장폐색, 위장 출혈 또는 대변 매복으로 인한 급성 복통이 있는 환자는 설사제나 관장제를 사용해서는 안 됩니다.",
  ),
];
